<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_5_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%ED%96%89%2C%EC%97%B4_(row%2C_column)_%EC%84%A0%ED%83%9D_%EB%B0%8F_%ED%95%84%ED%84%B0%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friend_list = [{'name': 'John', 'age': 20, 'job': 'student'},
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_list)

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df = df[1:3]

In [ ]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
friend_list = [{'name': 'John', 'age': 20, 'job': 'student'},
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_list)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
friend_list = [{'name': 'John', 'age': 20, 'job': 'student'},
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_list)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
### by column condition
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df[(df.age > 25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

In [ ]:
### Filter Column
## by index

friend_list = [
               ['John', 20, 'student'],
               ['Jenny', 30, 'developer'],
               ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [ ]:
df.iloc[:,0:2] # []안의 순서 앞 부분 = 행(row), 뒷 부분 = 열(Column)

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [ ]:
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Jenny  30

In [ ]:
## by column name
df = pd.read_csv('/content/drive/MyDrive/Private_room/Inflearn/Pandas Data Analysis/data/friend_list_no_head.csv',
                 header = None,
                 names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# 컬러안에 'a'가 들어간 것만 찾을 수 있다. 
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [ ]:
# regex < 정규식표현을 써서 컬럼 분리하기
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [ ]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25